# IFCFileWriteOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCFileWriteOptions Constructor
IFCFileWriteOptions Class See Also
---
Creates a default IFCFileWriteOptions. The default file format is ifc.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IFCFileWriteOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
IFCFileWriteOptions()
```

# See Also
IFCFileWriteOptions Class
Autodesk.Revit.DB.IFC Namespace